Tekla.Structures.Internal.dotConnectionType_t
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.IsConnection
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.SecondaryType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.InputObjectType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.PositionType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.DetailType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.AutoDirectionType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotConnectionType_t.SeamInputType
DO NOT USE! For internal usage only!